2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/LEV_afnemerindicaties_request_template_LB.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:brp="http://www.bzk.nl/brp/brp0200">
   <soapenv:Header>${DataSource Values#Header_EEE1}</soapenv:Header>
   <soapenv:Body>
      <brp:lvg_synRegistreerAfnemerindicatie>
         <brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
            <brp:zendendePartij>${DataSource Values#zendendePartij_zsL1}</brp:zendendePartij>
            <brp:zendendeSysteem>${DataSource Values#zendendeSysteem_zsL1}</brp:zendendeSysteem>
            <brp:referentienummer>${DataSource Values#referentienummer_sLB1}</brp:referentienummer>
            <brp:tijdstipVerzending>[moment_volgen]</brp:tijdstipVerzending>
         </brp:stuurgegevens>
         <brp:plaatsingAfnemerindicatie brp:communicatieID="${DataSource Values#comid.plaatsingAfnemerindicatie1}"
                                        brp:objecttype="AdministratieveHandeling">
            <brp:partijCode>${DataSource Values#partijCode_pLB1}</brp:partijCode>
            <brp:gedeblokkeerdeMeldingen>
               <brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#comid.gedeblokkeerdeMelding1}"
										  brp:referentieID="${DataSource Values#|refid.gedeblokkeerdeMelding1|}"
                                          brp:objecttype="GedeblokkeerdeMelding">
               <!--1 or more repetitiobrp:-->
                  <brp:regelCode>${DataSource Values#regelCode_ggp1}</brp:regelCode>
                  <!--Optional:-->
                  <brp:elementNaam>${DataSource Values#elementNaam_ggp1}</brp:elementNaam>
               </brp:gedeblokkeerdeMelding>
            </brp:gedeblokkeerdeMeldingen>
            <brp:acties>
               <brp:registratieAfnemerindicatie brp:communicatieID="${DataSource Values#comid.registratieAfnemerindicatie1}" brp:objecttype="Actie">
                  <brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_rap1}</brp:datumAanvangGeldigheid>
                  <brp:persoon brp:communicatieID="${DataSource Values#comid.persoon1}" brp:objecttype="Persoon">
                     <brp:identificatienummers brp:communicatieID="${DataSource Values#comid.identificatienummers1}">
                        <brp:burgerservicenummer>${DataSource Values#burgerservicenummer_ipr1}</brp:burgerservicenummer>
                     </brp:identificatienummers>
                     <brp:afnemerindicaties>
                        <brp:afnemerindicatie brp:communicatieID="${DataSource Values#comid.afnemerindicatie1}"
                                              brp:objecttype="PersoonAfnemerindicatie">
                           <brp:afnemerCode>${DataSource Values#afnemerCode_aap1}</brp:afnemerCode>
                           <brp:abonnementNaam>${DataSource Values#abonnementNaam_aap1}</brp:abonnementNaam>
                          <brp:datumAanvangMaterielePeriode>${DataSource Values#datumAanvangMaterielePeriode_aap1}</brp:datumAanvangMaterielePeriode>
                          <brp:datumTijdEindeVolgen>${DataSource Values#datumTijdEindeVolgen_aap1}</brp:datumTijdEindeVolgen>
                        </brp:afnemerindicatie>
                     </brp:afnemerindicaties>
                  </brp:persoon>
               </brp:registratieAfnemerindicatie>
            </brp:acties>
         </brp:plaatsingAfnemerindicatie>
         <brp:verwijderingAfnemerindicatie brp:communicatieID="${DataSource Values#comid.verwijderingAfnemerindicatie1}"
                                           brp:objecttype="AdministratieveHandeling">
            <brp:partijCode>${DataSource Values#partijCode_vLB1}</brp:partijCode>
            <!--Optional:-->
            <brp:gedeblokkeerdeMeldingen>
               <!--1 or more repetitions:-->
               <brp:gedeblokkeerdeMelding brp:communicatieID="${DataSource Values#comid.gedeblokkeerdeMelding2}"
										  brp:referentieID="${DataSource Values#|refid.gedeblokkeerdeMelding2|}"
                                          brp:objecttype="GedeblokkeerdeMelding">
                  <brp:regelCode>${DataSource Values#regelCode_ggv1}</brp:regelCode>
                  <!--Optional:-->
                  <brp:elementNaam>${DataSource Values#elementNaam_ggv1}</brp:elementNaam>
               </brp:gedeblokkeerdeMelding>
            </brp:gedeblokkeerdeMeldingen>
            <brp:acties>
               <!--1 or more repetitions:-->
               <brp:vervalAfnemerindicatie brp:communicatieID="${DataSource Values#comid.vervalAfnemerindicatie1}" brp:objecttype="Actie">
                  <brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_vav1}</brp:datumAanvangGeldigheid>
                  <brp:persoon brp:communicatieID="${DataSource Values#comid.persoon2}" brp:objecttype="Persoon">
                     <brp:identificatienummers brp:communicatieID="${DataSource Values#comid.identificatienummers2}">
                        <brp:burgerservicenummer>${DataSource Values#burgerservicenummer_ipv1}</brp:burgerservicenummer>
                     </brp:identificatienummers>
                     <brp:afnemerindicaties>
               			<!--1 or more repetitions:-->
                        <brp:afnemerindicatie brp:communicatieID="${DataSource Values#comid.afnemerindicatie2}"
                                              brp:objecttype="PersoonAfnemerindicatie">
                           <brp:afnemerCode>${DataSource Values#afnemerCode_aap2}</brp:afnemerCode>
                           <brp:abonnementNaam>${DataSource Values#abonnementNaam_aap2}</brp:abonnementNaam>
                        </brp:afnemerindicatie>
                     </brp:afnemerindicaties>
                  </brp:persoon>
               </brp:vervalAfnemerindicatie>
            </brp:acties>
         </brp:verwijderingAfnemerindicatie>
      </brp:lvg_synRegistreerAfnemerindicatie>
   </soapenv:Body>
</soapenv:Envelope>
